result_benchmark.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: benchmark_test.js
        output: -

     scenarios: (100.00%) 1 scenario, 10 max VUs, 1m0s max duration (incl. graceful stop):
              * default: 10 looping VUs for 30s (gracefulStop: 30s)


running (0m01.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default   [   3% ] 10 VUs  01.0s/30s

running (0m02.0s), 10/10 VUs, 10 complete and 0 interrupted iterations
default   [   7% ] 10 VUs  02.0s/30s

running (0m03.0s), 10/10 VUs, 20 complete and 0 interrupted iterations
default   [  10% ] 10 VUs  03.0s/30s

running (0m04.0s), 10/10 VUs, 30 complete and 0 interrupted iterations
default   [  13% ] 10 VUs  04.0s/30s

running (0m05.0s), 10/10 VUs, 40 complete and 0 interrupted iterations
default   [  17% ] 10 VUs  05.0s/30s

running (0m06.0s), 10/10 VUs, 50 complete and 0 interrupted iterations
default   [  20% ] 10 VUs  06.0s/30s

running (0m07.0s), 10/10 VUs, 60 complete and 0 interrupted iterations
default   [  23% ] 10 VUs  07.0s/30s

running (0m08.0s), 10/10 VUs, 60 complete and 0 interrupted iterations
default   [  27% ] 10 VUs  08.0s/30s

running (0m09.0s), 10/10 VUs, 70 complete and 0 interrupted iterations
default   [  30% ] 10 VUs  09.0s/30s

running (0m10.0s), 10/10 VUs, 80 complete and 0 interrupted iterations
default   [  33% ] 10 VUs  10.0s/30s

running (0m11.0s), 10/10 VUs, 90 complete and 0 interrupted iterations
default   [  37% ] 10 VUs  11.0s/30s

running (0m12.0s), 10/10 VUs, 100 complete and 0 interrupted iterations
default   [  40% ] 10 VUs  12.0s/30s

running (0m13.0s), 10/10 VUs, 110 complete and 0 interrupted iterations
default   [  43% ] 10 VUs  13.0s/30s

running (0m14.0s), 10/10 VUs, 120 complete and 0 interrupted iterations
default   [  47% ] 10 VUs  14.0s/30s

running (0m15.0s), 10/10 VUs, 130 complete and 0 interrupted iterations
default   [  50% ] 10 VUs  15.0s/30s

running (0m16.0s), 10/10 VUs, 130 complete and 0 interrupted iterations
default   [  53% ] 10 VUs  16.0s/30s

running (0m17.0s), 10/10 VUs, 140 complete and 0 interrupted iterations
default   [  57% ] 10 VUs  17.0s/30s

running (0m18.0s), 10/10 VUs, 150 complete and 0 interrupted iterations
default   [  60% ] 10 VUs  18.0s/30s

running (0m19.0s), 10/10 VUs, 160 complete and 0 interrupted iterations
default   [  63% ] 10 VUs  19.0s/30s

running (0m20.0s), 10/10 VUs, 170 complete and 0 interrupted iterations
default   [  67% ] 10 VUs  20.0s/30s

running (0m21.0s), 10/10 VUs, 180 complete and 0 interrupted iterations
default   [  70% ] 10 VUs  21.0s/30s

running (0m22.0s), 10/10 VUs, 190 complete and 0 interrupted iterations
default   [  73% ] 10 VUs  22.0s/30s

running (0m23.0s), 10/10 VUs, 200 complete and 0 interrupted iterations
default   [  77% ] 10 VUs  23.0s/30s

running (0m24.0s), 10/10 VUs, 200 complete and 0 interrupted iterations
default   [  80% ] 10 VUs  24.0s/30s

running (0m25.0s), 10/10 VUs, 210 complete and 0 interrupted iterations
default   [  83% ] 10 VUs  25.0s/30s

running (0m26.0s), 10/10 VUs, 220 complete and 0 interrupted iterations
default   [  87% ] 10 VUs  26.0s/30s

running (0m27.0s), 10/10 VUs, 230 complete and 0 interrupted iterations
default   [  90% ] 10 VUs  27.0s/30s

running (0m28.0s), 10/10 VUs, 240 complete and 0 interrupted iterations
default   [  93% ] 10 VUs  28.0s/30s

running (0m29.0s), 10/10 VUs, 250 complete and 0 interrupted iterations
default   [  97% ] 10 VUs  29.0s/30s

running (0m30.0s), 10/10 VUs, 260 complete and 0 interrupted iterations
default   [ 100% ] 10 VUs  30.0s/30s


  █ TOTAL RESULTS 

    checks_total.......: 13500  438.273828/s
    checks_succeeded...: 6.34%  857 out of 13500
    checks_failed......: 93.65% 12643 out of 13500

    ✓ GET /posts status is 200
    ✓ GET /posts/40 status is 200
    ✓ POST /posts status is 201
    ✗ DELETE /posts/4 status is 200 
      ↳  0% — ✓ 1 / ✗ 269
    ✗ DELETE /posts/5 status is 200 
      ↳  0% — ✓ 1 / ✗ 269
    ✗ DELETE /posts/6 status is 200 
      ↳  0% — ✓ 1 / ✗ 269
    ✗ DELETE /posts/7 status is 200 
      ↳  0% — ✓ 1 / ✗ 269
    ✗ DELETE /posts/8 status is 200 
      ↳  0% — ✓ 1 / ✗ 269
    ✗ DELETE /posts/9 status is 200 
      ↳  0% — ✓ 1 / ✗ 269
    ✗ DELETE /posts/10 status is 200 
      ↳  0% — ✓ 1 / ✗ 269
    ✗ DELETE /posts/11 status is 200 
      ↳  0% — ✓ 1 / ✗ 269
    ✗ DELETE /posts/12 status is 200 
      ↳  0% — ✓ 1 / ✗ 269
    ✗ DELETE /posts/13 status is 200 
      ↳  0% — ✓ 1 / ✗ 269
    ✗ DELETE /posts/14 status is 200 
      ↳  0% — ✓ 1 / ✗ 269
    ✗ DELETE /posts/15 status is 200 
      ↳  0% — ✓ 1 / ✗ 269
    ✗ DELETE /posts/16 status is 200 
      ↳  0% — ✓ 1 / ✗ 269
    ✗ DELETE /posts/17 status is 200 
      ↳  0% — ✓ 1 / ✗ 269
    ✗ DELETE /posts/18 status is 200 
      ↳  0% — ✓ 1 / ✗ 269
    ✗ DELETE /posts/19 status is 200 
      ↳  0% — ✓ 1 / ✗ 269
    ✗ DELETE /posts/20 status is 200 
      ↳  0% — ✓ 1 / ✗ 269
    ✗ DELETE /posts/21 status is 200 
      ↳  0% — ✓ 1 / ✗ 269
    ✗ DELETE /posts/22 status is 200 
      ↳  0% — ✓ 1 / ✗ 269
    ✗ DELETE /posts/23 status is 200 
      ↳  0% — ✓ 1 / ✗ 269
    ✗ DELETE /posts/24 status is 200 
      ↳  0% — ✓ 1 / ✗ 269
    ✗ DELETE /posts/25 status is 200 
      ↳  0% — ✓ 1 / ✗ 269
    ✗ DELETE /posts/26 status is 200 
      ↳  0% — ✓ 1 / ✗ 269
    ✗ DELETE /posts/27 status is 200 
      ↳  0% — ✓ 1 / ✗ 269
    ✗ DELETE /posts/28 status is 200 
      ↳  0% — ✓ 1 / ✗ 269
    ✗ DELETE /posts/29 status is 200 
      ↳  0% — ✓ 1 / ✗ 269
    ✗ DELETE /posts/30 status is 200 
      ↳  0% — ✓ 1 / ✗ 269
    ✗ DELETE /posts/31 status is 200 
      ↳  0% — ✓ 1 / ✗ 269
    ✗ DELETE /posts/32 status is 200 
      ↳  0% — ✓ 1 / ✗ 269
    ✗ DELETE /posts/33 status is 200 
      ↳  0% — ✓ 1 / ✗ 269
    ✗ DELETE /posts/34 status is 200 
      ↳  0% — ✓ 1 / ✗ 269
    ✗ DELETE /posts/35 status is 200 
      ↳  0% — ✓ 1 / ✗ 269
    ✗ DELETE /posts/36 status is 200 
      ↳  0% — ✓ 1 / ✗ 269
    ✗ DELETE /posts/37 status is 200 
      ↳  0% — ✓ 1 / ✗ 269
    ✗ DELETE /posts/38 status is 200 
      ↳  0% — ✓ 1 / ✗ 269
    ✗ DELETE /posts/39 status is 200 
      ↳  0% — ✓ 1 / ✗ 269
    ✗ DELETE /posts/40 status is 200 
      ↳  0% — ✓ 1 / ✗ 269
    ✗ DELETE /posts/41 status is 200 
      ↳  0% — ✓ 1 / ✗ 269
    ✗ DELETE /posts/42 status is 200 
      ↳  0% — ✓ 1 / ✗ 269
    ✗ DELETE /posts/43 status is 200 
      ↳  0% — ✓ 1 / ✗ 269
    ✗ DELETE /posts/44 status is 200 
      ↳  0% — ✓ 1 / ✗ 269
    ✗ DELETE /posts/45 status is 200 
      ↳  0% — ✓ 1 / ✗ 269
    ✗ DELETE /posts/46 status is 200 
      ↳  0% — ✓ 1 / ✗ 269
    ✗ DELETE /posts/47 status is 200 
      ↳  0% — ✓ 1 / ✗ 269
    ✗ DELETE /posts/48 status is 200 
      ↳  0% — ✓ 1 / ✗ 269
    ✗ DELETE /posts/49 status is 200 
      ↳  0% — ✓ 1 / ✗ 269
    ✗ DELETE /posts/50 status is 200 
      ↳  0% — ✓ 1 / ✗ 269

    HTTP
    http_req_duration..............: avg=2.62ms min=230.49µs med=2.11ms max=30.31ms p(90)=5.03ms p(95)=6.38ms 
      { expected_response:true }...: avg=5.59ms min=595.1µs  med=4.72ms max=30.31ms p(90)=9.69ms p(95)=11.34ms
    http_req_failed................: 93.65% 12643 out of 13500
    http_reqs......................: 13500  438.273828/s

    EXECUTION
    iteration_duration.............: avg=1.14s  min=1.1s     med=1.12s  max=1.24s   p(90)=1.2s   p(95)=1.23s  
    iterations.....................: 270    8.765477/s
    vus............................: 10     min=10             max=10
    vus_max........................: 10     min=10             max=10

    NETWORK
    data_received..................: 7.3 MB 238 kB/s
    data_sent......................: 4.1 MB 135 kB/s



running (0m30.8s), 00/10 VUs, 270 complete and 0 interrupted iterations
default ✓ [ 100% ] 10 VUs  30s